In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df=pd.DataFrame({"UID":["20BCS5687","20BCS5688","20BCS5700"],"NAME":["SHIVANSH","DEVANSH","GAGAN"],})

In [4]:
df

         UID      NAME
0  20BCS5687  SHIVANSH
1  20BCS5688   DEVANSH
2  20BCS5700     GAGAN

In [9]:
df=pd.DataFrame({"UID":["20BCS5687","20BCS5688","20BCS5700","2OBCS5676","20BCS5577","20BCS5565","20BCS5567","20BCS5589","20BCS4567","20BCS5345"],"NAME":["SHIVANSH","DEVANSH","GAGAN","JATIN","AMAN","ROHAN","SONU","RAHUL","JIVAN","SAURAV"],"SECTION":["904-A","904-A","904-B","902-A","902-B","905-A","908-B","909-A","906-B","907-B"],})

In [10]:
df

         UID      NAME SECTION
0  20BCS5687  SHIVANSH   904-A
1  20BCS5688   DEVANSH   904-A
2  20BCS5700     GAGAN   904-B
3  2OBCS5676     JATIN   902-A
4  20BCS5577      AMAN   902-B
5  20BCS5565     ROHAN   905-A
6  20BCS5567      SONU   908-B
7  20BCS5589     RAHUL   909-A
8  20BCS4567     JIVAN   906-B
9  20BCS5345    SAURAV   907-B

In [11]:
df["UID"]

0    20BCS5687
1    20BCS5688
2    20BCS5700
3    2OBCS5676
4    20BCS5577
5    20BCS5565
6    20BCS5567
7    20BCS5589
8    20BCS4567
9    20BCS5345
Name: UID, dtype: object

In [12]:
df["NAME"]

0    SHIVANSH
1     DEVANSH
2       GAGAN
3       JATIN
4        AMAN
5       ROHAN
6        SONU
7       RAHUL
8       JIVAN
9      SAURAV
Name: NAME, dtype: object

In [14]:
df.iloc[2,1]

'GAGAN'

In [16]:
df.iloc[0:2,0:2]

         UID      NAME
0  20BCS5687  SHIVANSH
1  20BCS5688   DEVANSH

In [17]:
df.iloc[: ,0:2]

         UID      NAME
0  20BCS5687  SHIVANSH
1  20BCS5688   DEVANSH
2  20BCS5700     GAGAN
3  2OBCS5676     JATIN
4  20BCS5577      AMAN
5  20BCS5565     ROHAN
6  20BCS5567      SONU
7  20BCS5589     RAHUL
8  20BCS4567     JIVAN
9  20BCS5345    SAURAV

In [18]:
df.loc[1:,"NAME"]

1    DEVANSH
2      GAGAN
3      JATIN
4       AMAN
5      ROHAN
6       SONU
7      RAHUL
8      JIVAN
9     SAURAV
Name: NAME, dtype: object

In [19]:
df.shape

(10, 3)

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
type(df.shape)

tuple

In [25]:
df=pd.read_csv("C:\\Users\HP\Downloads\ML EXPERIMENT\\titanic-train.csv")

In [26]:
df

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [27]:
print(df.corr())

             PassengerId  Survived    Pclass       Age     SibSp     Parch  \
PassengerId     1.000000 -0.005007 -0.035144  0.036847 -0.057527 -0.001652
Survived       -0.005007  1.000000 -0.338481 -0.077221 -0.035322  0.081629
Pclass         -0.035144 -0.338481  1.000000 -0.369226  0.083081  0.018443
Age             0.036847 -0.077221 -0.369226  1.000000 -0.308247 -0.189119
SibSp          -0.057527 -0.035322  0.083081 -0.308247  1.000000  0.414838
Parch          -0.001652  0.081629  0.018443 -0.189119  0.414838  1.000000
Fare            0.012658  0.257307 -0.549500  0.096067  0.159651  0.216225

                 Fare
PassengerId  0.012658
Survived     0.257307
Pclass      -0.549500
Age          0.096067
SibSp        0.159651
Parch        0.216225
Fare         1.000000

In [28]:
df.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000